<script setup lang="ts">
const config = useRuntimeConfig()
const subjects = [
  {name:'Проблема с качеством',val:'Проблема с качеством'}   ,
  {name:'Гарантийный ремонт',val:'Гарантийный ремонт'}   ,
  {name:'Вопрос о работе оборудования',val:'Вопрос о работе оборудования'}   ,
  {name:'Иное',val:'Иное'}   ,
]

const loading = ref(false)
const isSent = ref(false)
const errorMsg = ref('')
const formData=ref({
  name:null,
  email:null,
  phone:null,
  subject:null,
  text:null,
  file:null,
})


const fileSelected = (e) => {
  formData.value.file = e.files[0]
}
const formSubmit = async () => {
  loading.value = !loading.value
  errorMsg.value = ''
  let fd = new FormData()
  for (let [k,v] of Object.entries(formData.value)){
    v ? fd.append(k,v) : null
  }
  const {data, pending, error, refresh} = await useFetch(config.public.APIURL + `/api/data/form`,{
    method: 'POST',
    body: fd
  })
  if (error?.value?.data){
    for (let [k,v] of Object.entries(error?.value?.data)){
      console.log(k,v)
      errorMsg.value += `${v[0]}<br>`
    }
  }else {
    isSent.value = true
  }
  for (let [k,v] of Object.entries(formData.value)){
    formData.value[k] = null
  }
  loading.value = !loading.value

}
</script>

<template>
  <div class="container mb-4 md:mb-8">
    <div class="breadbrumbs mb-4 md:mb-6">
      <router-link to="/">Главная</router-link>
      <p>Связаться с нами</p>
    </div>

    <h1 class="text-4xl md:text-6xl mb-4 ">Связаться с нами</h1>
    <p class="mb-3 md:mb-4 max-w-half line-height-3">
      В FELFRI мы высоко ценим каждого клиента и стремимся оказывать максимально качественный сервис. Если у вас возникли вопросы, проблемы или пожелания, связанные с нашей продукцией, мы всегда рады помочь!<br><br>
   </p>

    <div  class="grid mb-4">
      <div class="col-12 md:col-6">
        <div class="grey-block p-5 h-full">
          <p class="text-3xl mb-4 ">Тех поддержка</p>
          <p class="grey-color mb-3">Ежедневно<br>с 8:30 до 20:30</p>
          <div class="separator mb-3"></div>
          <div class="grid">
            <div class="col-12 md:col-6">
              <a href="mailto:support@felfri.ru" target="_blank">
                <div class="flex bg-white p-3 border-round-lg align-items-center gap-2">
                  <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <circle cx="16" cy="16" r="16" fill="#D9D9D9"/>
                    <path fill-rule="evenodd" clip-rule="evenodd" d="M10 9H22C23.0609 9 24.0783 9.42143 24.8284 10.1716C25.5786 10.9217 26 11.9391 26 13V20C26 21.0609 25.5786 22.0783 24.8284 22.8284C24.0783 23.5786 23.0609 24 22 24H10C8.93913 24 7.92172 23.5786 7.17157 22.8284C6.42143 22.0783 6 21.0609 6 20V13C6 11.9391 6.42143 10.9217 7.17157 10.1716C7.92172 9.42143 8.93913 9 10 9ZM10 11C9.46957 11 8.96086 11.2107 8.58579 11.5858C8.21071 11.9609 8 12.4696 8 13V20C8 20.5304 8.21071 21.0391 8.58579 21.4142C8.96086 21.7893 9.46957 22 10 22H22C22.5304 22 23.0391 21.7893 23.4142 21.4142C23.7893 21.0391 24 20.5304 24 20V13C24 12.4696 23.7893 11.9609 23.4142 11.5858C23.0391 11.2107 22.5304 11 22 11H10Z" fill="#3B3B41"/>
                    <path fill-rule="evenodd" clip-rule="evenodd" d="M7.64305 10.986C7.71061 10.8734 7.79969 10.7752 7.90521 10.697C8.01073 10.6188 8.13061 10.5622 8.25801 10.5304C8.38541 10.4985 8.51784 10.4921 8.64773 10.5114C8.77762 10.5307 8.90244 10.5754 9.01505 10.643L15.485 14.525C15.6406 14.6185 15.8186 14.6678 16 14.6678C16.1815 14.6678 16.3595 14.6185 16.515 14.525L22.985 10.643C23.0977 10.5754 23.2225 10.5306 23.3524 10.5112C23.4823 10.4918 23.6148 10.4982 23.7422 10.53C23.8697 10.5618 23.9896 10.6184 24.0952 10.6966C24.2008 10.7747 24.2899 10.8729 24.3575 10.9855C24.4252 11.0981 24.47 11.2229 24.4894 11.3529C24.5087 11.4828 24.5024 11.6152 24.4706 11.7427C24.4387 11.8701 24.3822 11.9901 24.304 12.0957C24.2258 12.2012 24.1277 12.2904 24.015 12.358L17.543 16.24C17.0769 16.5196 16.5436 16.6672 16 16.6672C15.4565 16.6672 14.9232 16.5196 14.457 16.24L7.98405 12.358C7.75679 12.2214 7.5931 12.0001 7.52896 11.7428C7.46483 11.4855 7.5065 11.2133 7.64305 10.986Z" fill="#3B3B41"/>
                  </svg>

                  <p class="text-xs grey-color">написать нам на почту</p>
                </div>
              </a>
            </div>
            <div class="col-12 md:col-6">
              <a href="https://wa.me/+79165723093" target="_blank">
                <div class="flex bg-white p-3 border-round-lg align-items-center gap-2">
                  <svg width="31" height="31" viewBox="0 0 31 31" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M15.5517 2.58357C8.4992 2.58357 2.75128 8.33148 2.75128 15.384C2.75128 17.6444 3.34545 19.8402 4.45628 21.7777L2.64795 28.4169L9.4292 26.6344C11.3021 27.6548 13.4075 28.1973 15.5517 28.1973C22.6042 28.1973 28.3521 22.4494 28.3521 15.3969C28.3521 11.974 27.0217 8.75773 24.6063 6.34232C23.4219 5.14637 22.0114 4.19811 20.4568 3.55278C18.9023 2.90746 17.2348 2.57799 15.5517 2.58357ZM15.5646 4.74065C18.4063 4.74065 21.0671 5.85148 23.0821 7.86648C24.0707 8.85528 24.8546 10.0294 25.3887 11.3216C25.9229 12.6138 26.1969 13.9987 26.195 15.3969C26.195 21.2611 21.4159 26.0273 15.5517 26.0273C13.64 26.0273 11.7671 25.5236 10.1396 24.5419L9.75212 24.3223L5.72212 25.3815L6.7942 21.4548L6.53587 21.0415C5.46965 19.3473 4.90536 17.3857 4.90837 15.384C4.92128 9.51982 9.68753 4.74065 15.5646 4.74065ZM11.0179 9.46815C10.8113 9.46815 10.4625 9.54565 10.1654 9.86857C9.88128 10.1915 9.0417 10.9794 9.0417 12.5423C9.0417 14.1181 10.1913 15.6294 10.3334 15.849C10.5142 16.0686 12.6067 19.2977 15.8229 20.6669C16.585 21.0156 17.1792 21.2094 17.6442 21.3515C18.4063 21.5969 19.1038 21.5581 19.6592 21.4806C20.2792 21.3902 21.545 20.7056 21.8163 19.9565C22.0875 19.2073 22.0875 18.5744 22.01 18.4323C21.9196 18.3032 21.7129 18.2256 21.39 18.0836C21.0671 17.9027 19.4913 17.1277 19.2071 17.0244C18.91 16.9211 18.7292 16.8694 18.4838 17.1794C18.2771 17.5023 17.6571 18.2256 17.4763 18.4323C17.2825 18.6519 17.1017 18.6777 16.7917 18.5227C16.4559 18.3548 15.4225 18.019 14.2084 16.934C13.2525 16.0815 12.6196 15.0352 12.4259 14.7123C12.2709 14.4023 12.4129 14.2086 12.5679 14.0665C12.71 13.9244 12.9167 13.6919 13.0459 13.4981C13.2138 13.3173 13.2654 13.1752 13.3688 12.9686C13.4721 12.749 13.4204 12.5681 13.3429 12.4131C13.2654 12.2711 12.6196 10.6694 12.3484 10.0365C12.09 9.41648 11.8317 9.49398 11.625 9.48107C11.4442 9.48107 11.2375 9.46815 11.0179 9.46815Z" fill="#2BA35B"/>
                  </svg>

                  <p class="text-xs grey-color">Написать нам в WhatsApp</p>
                </div>
              </a>
            </div>
          </div>


        </div>
      </div>
      <div class="col-12 md:col-6">
        <div class="grey-block p-5 h-full">

          <p class="text-3xl mb-4 ">Единая линия для обращений</p>
          <p class="grey-color mb-3">Ежедневно<br>с 8:30 до 20:30</p>
          <div class="separator mb-3"></div>
          <div class="grid">
            <div class="col-12 md:col-6">
              <a href="mailto:support@felfri.ru" target="_blank">
                <div class="flex bg-white p-3 border-round-lg align-items-center gap-2">
                  <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <circle cx="16" cy="16" r="16" fill="#D9D9D9"/>
                    <path fill-rule="evenodd" clip-rule="evenodd" d="M10 9H22C23.0609 9 24.0783 9.42143 24.8284 10.1716C25.5786 10.9217 26 11.9391 26 13V20C26 21.0609 25.5786 22.0783 24.8284 22.8284C24.0783 23.5786 23.0609 24 22 24H10C8.93913 24 7.92172 23.5786 7.17157 22.8284C6.42143 22.0783 6 21.0609 6 20V13C6 11.9391 6.42143 10.9217 7.17157 10.1716C7.92172 9.42143 8.93913 9 10 9ZM10 11C9.46957 11 8.96086 11.2107 8.58579 11.5858C8.21071 11.9609 8 12.4696 8 13V20C8 20.5304 8.21071 21.0391 8.58579 21.4142C8.96086 21.7893 9.46957 22 10 22H22C22.5304 22 23.0391 21.7893 23.4142 21.4142C23.7893 21.0391 24 20.5304 24 20V13C24 12.4696 23.7893 11.9609 23.4142 11.5858C23.0391 11.2107 22.5304 11 22 11H10Z" fill="#3B3B41"/>
                    <path fill-rule="evenodd" clip-rule="evenodd" d="M7.64305 10.986C7.71061 10.8734 7.79969 10.7752 7.90521 10.697C8.01073 10.6188 8.13061 10.5622 8.25801 10.5304C8.38541 10.4985 8.51784 10.4921 8.64773 10.5114C8.77762 10.5307 8.90244 10.5754 9.01505 10.643L15.485 14.525C15.6406 14.6185 15.8186 14.6678 16 14.6678C16.1815 14.6678 16.3595 14.6185 16.515 14.525L22.985 10.643C23.0977 10.5754 23.2225 10.5306 23.3524 10.5112C23.4823 10.4918 23.6148 10.4982 23.7422 10.53C23.8697 10.5618 23.9896 10.6184 24.0952 10.6966C24.2008 10.7747 24.2899 10.8729 24.3575 10.9855C24.4252 11.0981 24.47 11.2229 24.4894 11.3529C24.5087 11.4828 24.5024 11.6152 24.4706 11.7427C24.4387 11.8701 24.3822 11.9901 24.304 12.0957C24.2258 12.2012 24.1277 12.2904 24.015 12.358L17.543 16.24C17.0769 16.5196 16.5436 16.6672 16 16.6672C15.4565 16.6672 14.9232 16.5196 14.457 16.24L7.98405 12.358C7.75679 12.2214 7.5931 12.0001 7.52896 11.7428C7.46483 11.4855 7.5065 11.2133 7.64305 10.986Z" fill="#3B3B41"/>
                  </svg>

                  <p class="text-xs grey-color">написать нам на почту</p>
                </div>
              </a>
            </div>
            <div class="col-12 md:col-6">
              <a href="https://wa.me/+79165723093" target="_blank">
                <div class="flex bg-white p-3 border-round-lg align-items-center gap-2">
                  <svg width="31" height="31" viewBox="0 0 31 31" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M15.5517 2.58357C8.4992 2.58357 2.75128 8.33148 2.75128 15.384C2.75128 17.6444 3.34545 19.8402 4.45628 21.7777L2.64795 28.4169L9.4292 26.6344C11.3021 27.6548 13.4075 28.1973 15.5517 28.1973C22.6042 28.1973 28.3521 22.4494 28.3521 15.3969C28.3521 11.974 27.0217 8.75773 24.6063 6.34232C23.4219 5.14637 22.0114 4.19811 20.4568 3.55278C18.9023 2.90746 17.2348 2.57799 15.5517 2.58357ZM15.5646 4.74065C18.4063 4.74065 21.0671 5.85148 23.0821 7.86648C24.0707 8.85528 24.8546 10.0294 25.3887 11.3216C25.9229 12.6138 26.1969 13.9987 26.195 15.3969C26.195 21.2611 21.4159 26.0273 15.5517 26.0273C13.64 26.0273 11.7671 25.5236 10.1396 24.5419L9.75212 24.3223L5.72212 25.3815L6.7942 21.4548L6.53587 21.0415C5.46965 19.3473 4.90536 17.3857 4.90837 15.384C4.92128 9.51982 9.68753 4.74065 15.5646 4.74065ZM11.0179 9.46815C10.8113 9.46815 10.4625 9.54565 10.1654 9.86857C9.88128 10.1915 9.0417 10.9794 9.0417 12.5423C9.0417 14.1181 10.1913 15.6294 10.3334 15.849C10.5142 16.0686 12.6067 19.2977 15.8229 20.6669C16.585 21.0156 17.1792 21.2094 17.6442 21.3515C18.4063 21.5969 19.1038 21.5581 19.6592 21.4806C20.2792 21.3902 21.545 20.7056 21.8163 19.9565C22.0875 19.2073 22.0875 18.5744 22.01 18.4323C21.9196 18.3032 21.7129 18.2256 21.39 18.0836C21.0671 17.9027 19.4913 17.1277 19.2071 17.0244C18.91 16.9211 18.7292 16.8694 18.4838 17.1794C18.2771 17.5023 17.6571 18.2256 17.4763 18.4323C17.2825 18.6519 17.1017 18.6777 16.7917 18.5227C16.4559 18.3548 15.4225 18.019 14.2084 16.934C13.2525 16.0815 12.6196 15.0352 12.4259 14.7123C12.2709 14.4023 12.4129 14.2086 12.5679 14.0665C12.71 13.9244 12.9167 13.6919 13.0459 13.4981C13.2138 13.3173 13.2654 13.1752 13.3688 12.9686C13.4721 12.749 13.4204 12.5681 13.3429 12.4131C13.2654 12.2711 12.6196 10.6694 12.3484 10.0365C12.09 9.41648 11.8317 9.49398 11.625 9.48107C11.4442 9.48107 11.2375 9.46815 11.0179 9.46815Z" fill="#2BA35B"/>
                  </svg>

                  <p class="text-xs grey-color">Написать нам в WhatsApp</p>
                </div>
              </a>
            </div>
          </div>

<!--          <p class="grey-color mb-3"><a class="text-primary" href="mailto:uqas.official@gmail.com">uqas.official@gmail.com</a> </p>-->

        </div>
      </div>
<!--      <div v-if="!isSent" class="col-12 md:col-7">-->
<!--        <InputText size="" placeholder="Ваше имя*" class="w-full mb-3" v-model="formData.name"/>-->
<!--        <InputText placeholder="E-mail*" class="w-full mb-3" v-model="formData.email"/>-->
<!--        <InputText placeholder="Контактный номер*" class="w-full mb-3" v-model="formData.phone"/>-->
<!--        <Dropdown :options="subjects" option-label="name" option-value="val" v-model="formData.subject" placeholder="Выберите тему сообщения" class="w-full mb-3" />-->
<!--        <Textarea placeholder="Введите ваше сообщение" class="w-full mb-4 md:mb-6" v-model="formData.text"/>-->
<!--        <div class="grid">-->
<!--          <div v-if="errorMsg" class="col-12">-->
<!--            <span class="text-red-500" v-html="errorMsg"></span>-->

<!--          </div>-->
<!--          <div class="col-12 md:col-4"><FileUpload  mode="basic" chooseLabel="Прикрепите файл" class=" btnBlue w-full" accept="image/*" @select="fileSelected"/></div>-->
<!--          <div class="col-12 md:col-8"><Button label="Отправить"-->

<!--                                               :loading="loading" @click="formSubmit" class="w-full btnBlue"/></div>-->
<!--&lt;!&ndash;          :disabled="!formData.name ||!formData.email ||!formData.phone"&ndash;&gt;-->
<!--        </div>-->



<!--      </div>-->
<!--      <div v-else class="col-12 md:col-7 text-6xl mb-4  text-green-500">Сообщение отправлено</div>-->
<!--      <div class="col-12 md:col-5">-->
<!--      -->
<!--      </div>-->
    </div>
    <p class="mb-4 md:mb-6 max-w-half line-height-3">
      Не стесняйтесь связываться с нами при любых обстоятельствах. Будь то гарантийный случай, сложности с заказом, пожелания по ассортименту или другие вопросы - мы обязательно найдем оптимальное решение и поможем разрешить любую проблему.<br><br>
      Ваша лояльность к бренду FELFRI - наш главный приоритет. Мы ценим ваш выбор и сделаем все возможное, чтобы вы остались довольны сотрудничеством с нами на все 100%!
    </p>
  </div>

</template>

<style scoped lang="sass">

</style>