<script setup lang="ts">
const config = useRuntimeConfig()
const subjects = [
  {name:'Проблема с качеством',val:'Проблема с качеством'}   ,
  {name:'Гарантийный ремонт',val:'Гарантийный ремонт'}   ,
  {name:'Вопрос о работе оборудования',val:'Вопрос о работе оборудования'}   ,
  {name:'Иное',val:'Иное'}   ,
]

const loading = ref(false)
const isSent = ref(false)
const errorMsg = ref('')
const formData=ref({
  name:null,
  email:null,
  phone:null,
  subject:null,
  text:null,
  file:null,
})


const fileSelected = (e) => {
  formData.value.file = e.files[0]
}
const formSubmit = async () => {
  loading.value = !loading.value
  errorMsg.value = ''
  let fd = new FormData()
  for (let [k,v] of Object.entries(formData.value)){
    v ? fd.append(k,v) : null
  }
  const {data, pending, error, refresh} = await useFetch(config.public.APIURL + `/api/data/form`,{
    method: 'POST',
    body: fd
  })
  if (error?.value?.data){
    for (let [k,v] of Object.entries(error?.value?.data)){
      console.log(k,v)
      errorMsg.value += `${v[0]}<br>`
    }
  }else {
    isSent.value = true
  }
  for (let [k,v] of Object.entries(formData.value)){
    formData.value[k] = null
  }
  loading.value = !loading.value

}
</script>

<template>
  <div class="container mb-4 md:mb-8">
    <div class="breadbrumbs mb-4 md:mb-6">
      <router-link to="/">Главная</router-link>
      <p>Связаться с нами</p>
    </div>

    <h1 class="text-4xl md:text-6xl mb-4 ">Связаться с нами</h1>
    <p class="mb-4 md:mb-6 max-w-half line-height-3">
      В FELFRI мы высоко ценим каждого клиента и стремимся оказывать максимально качественный сервис. Если у вас возникли вопросы, проблемы или пожелания, связанные с нашей продукцией, мы всегда рады помочь!<br><br>
      Воспользуйтесь формой обратной связи ниже, и наша квалифицированная служба поддержки оперативно рассмотрит ваше обращение. Мы также доступны по следующим контактам:
    </p>

    <div  class="grid mb-4">
      <div class="col-12 md:col-6">
        <div class="grey-block p-5 h-full">
          <p class="text-3xl mb-4 ">Тех поддержка</p>
          <p class="grey-color mb-3">Ежедневно<br>с 8:30 до 20:30</p>
          <div class="separator mb-3"></div>
          <div class="grid">
            <div class="col-12 md:col-6">
              <a href="tg://resolve?domain=uqas_support" target="_blank">
                <div class="flex bg-white p-3 border-round-lg align-items-center gap-2">
                  <svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <g clip-path="url(#clip0_32_8)">
                      <path d="M14.5312 0.46875C6.50584 0.46875 0 6.97459 0 15C0 23.0254 6.50584 29.5312 14.5312 29.5312C22.5567 29.5312 29.0625 23.0254 29.0625 15C29.0625 6.97459 22.5567 0.46875 14.5312 0.46875ZM21.2667 10.3512C21.048 12.6489 20.1018 18.2249 19.6202 20.7984C19.4166 21.8873 19.0154 22.2525 18.6272 22.2882C17.7834 22.3659 17.1425 21.7305 16.3252 21.1948C15.0463 20.3564 14.3238 19.8345 13.0823 19.0164C11.6476 18.071 12.5777 17.5516 13.3953 16.702C13.6093 16.4797 17.3273 13.0979 17.3993 12.7911C17.4083 12.7527 17.4169 12.6094 17.3317 12.5342C17.2465 12.459 17.1213 12.4845 17.0308 12.5049C16.9026 12.534 14.8594 13.8845 10.9014 16.5562C10.3215 16.9544 9.79627 17.1484 9.32561 17.1383C8.80676 17.1271 7.80873 16.8449 7.06676 16.6037C6.15674 16.3079 5.43346 16.1515 5.49645 15.6492C5.52926 15.3874 5.88961 15.1199 6.5775 14.8464C10.8137 13.0008 13.6384 11.784 15.0518 11.196C19.0873 9.5175 19.9258 9.22594 20.4724 9.21621C20.5926 9.21422 20.8614 9.24398 21.0354 9.38525C21.1513 9.48589 21.2251 9.62632 21.2423 9.77877C21.2718 9.96806 21.28 10.1601 21.2667 10.3512Z" fill="#2397D8"/>
                    </g>
                  </svg>
                  <p class="text-xs grey-color">Написать нам в Telegram</p>
                </div>
              </a>
            </div>
            <div class="col-12 md:col-6">
              <a href="https://wa.me/+79165723093" target="_blank">
                <div class="flex bg-white p-3 border-round-lg align-items-center gap-2">
                  <svg width="31" height="31" viewBox="0 0 31 31" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M15.5517 2.58357C8.4992 2.58357 2.75128 8.33148 2.75128 15.384C2.75128 17.6444 3.34545 19.8402 4.45628 21.7777L2.64795 28.4169L9.4292 26.6344C11.3021 27.6548 13.4075 28.1973 15.5517 28.1973C22.6042 28.1973 28.3521 22.4494 28.3521 15.3969C28.3521 11.974 27.0217 8.75773 24.6063 6.34232C23.4219 5.14637 22.0114 4.19811 20.4568 3.55278C18.9023 2.90746 17.2348 2.57799 15.5517 2.58357ZM15.5646 4.74065C18.4063 4.74065 21.0671 5.85148 23.0821 7.86648C24.0707 8.85528 24.8546 10.0294 25.3887 11.3216C25.9229 12.6138 26.1969 13.9987 26.195 15.3969C26.195 21.2611 21.4159 26.0273 15.5517 26.0273C13.64 26.0273 11.7671 25.5236 10.1396 24.5419L9.75212 24.3223L5.72212 25.3815L6.7942 21.4548L6.53587 21.0415C5.46965 19.3473 4.90536 17.3857 4.90837 15.384C4.92128 9.51982 9.68753 4.74065 15.5646 4.74065ZM11.0179 9.46815C10.8113 9.46815 10.4625 9.54565 10.1654 9.86857C9.88128 10.1915 9.0417 10.9794 9.0417 12.5423C9.0417 14.1181 10.1913 15.6294 10.3334 15.849C10.5142 16.0686 12.6067 19.2977 15.8229 20.6669C16.585 21.0156 17.1792 21.2094 17.6442 21.3515C18.4063 21.5969 19.1038 21.5581 19.6592 21.4806C20.2792 21.3902 21.545 20.7056 21.8163 19.9565C22.0875 19.2073 22.0875 18.5744 22.01 18.4323C21.9196 18.3032 21.7129 18.2256 21.39 18.0836C21.0671 17.9027 19.4913 17.1277 19.2071 17.0244C18.91 16.9211 18.7292 16.8694 18.4838 17.1794C18.2771 17.5023 17.6571 18.2256 17.4763 18.4323C17.2825 18.6519 17.1017 18.6777 16.7917 18.5227C16.4559 18.3548 15.4225 18.019 14.2084 16.934C13.2525 16.0815 12.6196 15.0352 12.4259 14.7123C12.2709 14.4023 12.4129 14.2086 12.5679 14.0665C12.71 13.9244 12.9167 13.6919 13.0459 13.4981C13.2138 13.3173 13.2654 13.1752 13.3688 12.9686C13.4721 12.749 13.4204 12.5681 13.3429 12.4131C13.2654 12.2711 12.6196 10.6694 12.3484 10.0365C12.09 9.41648 11.8317 9.49398 11.625 9.48107C11.4442 9.48107 11.2375 9.46815 11.0179 9.46815Z" fill="#2BA35B"/>
                  </svg>

                  <p class="text-xs grey-color">Написать нам в WhatsApp</p>
                </div>
              </a>
            </div>
          </div>


        </div>
      </div>
      <div class="col-12 md:col-6">
        <div class="grey-block p-5 h-full">

          <p class="text-3xl mb-4 ">Единая линия для обращений</p>
          <p class="grey-color mb-3">Ежедневно<br>с 8:30 до 20:30</p>
          <div class="separator mb-3"></div>
          <div class="grid">
            <div class="col-12 md:col-6">
              <a href="tg://resolve?domain=uqas_support" target="_blank">
                <div class="flex bg-white p-3 border-round-lg align-items-center gap-2">
                  <svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <g clip-path="url(#clip0_32_8)">
                      <path d="M14.5312 0.46875C6.50584 0.46875 0 6.97459 0 15C0 23.0254 6.50584 29.5312 14.5312 29.5312C22.5567 29.5312 29.0625 23.0254 29.0625 15C29.0625 6.97459 22.5567 0.46875 14.5312 0.46875ZM21.2667 10.3512C21.048 12.6489 20.1018 18.2249 19.6202 20.7984C19.4166 21.8873 19.0154 22.2525 18.6272 22.2882C17.7834 22.3659 17.1425 21.7305 16.3252 21.1948C15.0463 20.3564 14.3238 19.8345 13.0823 19.0164C11.6476 18.071 12.5777 17.5516 13.3953 16.702C13.6093 16.4797 17.3273 13.0979 17.3993 12.7911C17.4083 12.7527 17.4169 12.6094 17.3317 12.5342C17.2465 12.459 17.1213 12.4845 17.0308 12.5049C16.9026 12.534 14.8594 13.8845 10.9014 16.5562C10.3215 16.9544 9.79627 17.1484 9.32561 17.1383C8.80676 17.1271 7.80873 16.8449 7.06676 16.6037C6.15674 16.3079 5.43346 16.1515 5.49645 15.6492C5.52926 15.3874 5.88961 15.1199 6.5775 14.8464C10.8137 13.0008 13.6384 11.784 15.0518 11.196C19.0873 9.5175 19.9258 9.22594 20.4724 9.21621C20.5926 9.21422 20.8614 9.24398 21.0354 9.38525C21.1513 9.48589 21.2251 9.62632 21.2423 9.77877C21.2718 9.96806 21.28 10.1601 21.2667 10.3512Z" fill="#2397D8"/>
                    </g>
                  </svg>
                  <p class="text-xs grey-color">Написать нам в Telegram</p>
                </div>
              </a>
            </div>
            <div class="col-12 md:col-6">
              <a href="https://wa.me/+79165723093" target="_blank">
                <div class="flex bg-white p-3 border-round-lg align-items-center gap-2">
                  <svg width="31" height="31" viewBox="0 0 31 31" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M15.5517 2.58357C8.4992 2.58357 2.75128 8.33148 2.75128 15.384C2.75128 17.6444 3.34545 19.8402 4.45628 21.7777L2.64795 28.4169L9.4292 26.6344C11.3021 27.6548 13.4075 28.1973 15.5517 28.1973C22.6042 28.1973 28.3521 22.4494 28.3521 15.3969C28.3521 11.974 27.0217 8.75773 24.6063 6.34232C23.4219 5.14637 22.0114 4.19811 20.4568 3.55278C18.9023 2.90746 17.2348 2.57799 15.5517 2.58357ZM15.5646 4.74065C18.4063 4.74065 21.0671 5.85148 23.0821 7.86648C24.0707 8.85528 24.8546 10.0294 25.3887 11.3216C25.9229 12.6138 26.1969 13.9987 26.195 15.3969C26.195 21.2611 21.4159 26.0273 15.5517 26.0273C13.64 26.0273 11.7671 25.5236 10.1396 24.5419L9.75212 24.3223L5.72212 25.3815L6.7942 21.4548L6.53587 21.0415C5.46965 19.3473 4.90536 17.3857 4.90837 15.384C4.92128 9.51982 9.68753 4.74065 15.5646 4.74065ZM11.0179 9.46815C10.8113 9.46815 10.4625 9.54565 10.1654 9.86857C9.88128 10.1915 9.0417 10.9794 9.0417 12.5423C9.0417 14.1181 10.1913 15.6294 10.3334 15.849C10.5142 16.0686 12.6067 19.2977 15.8229 20.6669C16.585 21.0156 17.1792 21.2094 17.6442 21.3515C18.4063 21.5969 19.1038 21.5581 19.6592 21.4806C20.2792 21.3902 21.545 20.7056 21.8163 19.9565C22.0875 19.2073 22.0875 18.5744 22.01 18.4323C21.9196 18.3032 21.7129 18.2256 21.39 18.0836C21.0671 17.9027 19.4913 17.1277 19.2071 17.0244C18.91 16.9211 18.7292 16.8694 18.4838 17.1794C18.2771 17.5023 17.6571 18.2256 17.4763 18.4323C17.2825 18.6519 17.1017 18.6777 16.7917 18.5227C16.4559 18.3548 15.4225 18.019 14.2084 16.934C13.2525 16.0815 12.6196 15.0352 12.4259 14.7123C12.2709 14.4023 12.4129 14.2086 12.5679 14.0665C12.71 13.9244 12.9167 13.6919 13.0459 13.4981C13.2138 13.3173 13.2654 13.1752 13.3688 12.9686C13.4721 12.749 13.4204 12.5681 13.3429 12.4131C13.2654 12.2711 12.6196 10.6694 12.3484 10.0365C12.09 9.41648 11.8317 9.49398 11.625 9.48107C11.4442 9.48107 11.2375 9.46815 11.0179 9.46815Z" fill="#2BA35B"/>
                  </svg>

                  <p class="text-xs grey-color">Написать нам в WhatsApp</p>
                </div>
              </a>
            </div>
          </div>

          <p class="grey-color mb-3"><a class="text-primary" href="mailto:uqas.official@gmail.com">uqas.official@gmail.com</a> </p>

        </div>
      </div>
<!--      <div v-if="!isSent" class="col-12 md:col-7">-->
<!--        <InputText size="" placeholder="Ваше имя*" class="w-full mb-3" v-model="formData.name"/>-->
<!--        <InputText placeholder="E-mail*" class="w-full mb-3" v-model="formData.email"/>-->
<!--        <InputText placeholder="Контактный номер*" class="w-full mb-3" v-model="formData.phone"/>-->
<!--        <Dropdown :options="subjects" option-label="name" option-value="val" v-model="formData.subject" placeholder="Выберите тему сообщения" class="w-full mb-3" />-->
<!--        <Textarea placeholder="Введите ваше сообщение" class="w-full mb-4 md:mb-6" v-model="formData.text"/>-->
<!--        <div class="grid">-->
<!--          <div v-if="errorMsg" class="col-12">-->
<!--            <span class="text-red-500" v-html="errorMsg"></span>-->

<!--          </div>-->
<!--          <div class="col-12 md:col-4"><FileUpload  mode="basic" chooseLabel="Прикрепите файл" class=" btnBlue w-full" accept="image/*" @select="fileSelected"/></div>-->
<!--          <div class="col-12 md:col-8"><Button label="Отправить"-->

<!--                                               :loading="loading" @click="formSubmit" class="w-full btnBlue"/></div>-->
<!--&lt;!&ndash;          :disabled="!formData.name ||!formData.email ||!formData.phone"&ndash;&gt;-->
<!--        </div>-->



<!--      </div>-->
<!--      <div v-else class="col-12 md:col-7 text-6xl mb-4  text-green-500">Сообщение отправлено</div>-->
<!--      <div class="col-12 md:col-5">-->
<!--      -->
<!--      </div>-->
    </div>
    <p class="mb-4 md:mb-6 max-w-half line-height-3">
      Не стесняйтесь связываться с нами при любых обстоятельствах. Будь то гарантийный случай, сложности с заказом, пожелания по ассортименту или другие вопросы - мы обязательно найдем оптимальное решение и поможем разрешить любую проблему.<br><br>
      Ваша лояльность к бренду FELFRI - наш главный приоритет. Мы ценим ваш выбор и сделаем все возможное, чтобы вы остались довольны сотрудничеством с нами на все 100%!
    </p>
  </div>

</template>

<style scoped lang="sass">

</style>